"""
Chapter10-演算
"""

### 【四則演算】
"""
四則演算とは？
Pythonで数値を扱う基本的な演算には、足し算、引き算、掛け算、割り算などがあります。これらは電卓を使うのと同じです。

足し算 (例：5 + 2 ）
引き算 (例：5 - 2 )
掛け算 (例：5 * 2 )
割り算 (例：5 / 2 )
整数の割り算 (例：5 // 2 ) （小数点以下切り捨て）
剰余 (例：5 % 2 )（割り算の余り）
累乗 (例：5 ** 2 )
"""

### 【文字演算】
"""
文字列演算とは？
Pythonでは、文字列同士を結合したり、文字列を繰り返したりすることも「演算」と考えます。

文字列の結合 (+): "Python" + "演算" は "Python演算" です。
文字列の繰り返し (*): "Python" * 2 は "PythonPython" です。
"""

### 【比較演算】
"""
比較演算とは？
プログラミングでは、2つの値を比較して、それらが等しいか、あるいは一方がもう一方より大きいか小さいかを判断することがよくあります。

等しい (==): 5 == 2 は False です。
等しくない (!=): 5 != 2 は True です。
より大きい (>): 5 > 2 は True です。
より小さい (<): 5 < 2 は False です。
以上 (>=): 5 >= 2 は True です。
以下 (<=): 5 <= 2 は False です。
比較演算を使ってみよう
"""
